
INTERNET-DRAFT                                               Carl Kugler
<draft-ietf-ipp-job-printer-set-ops-00.txt>              IBM Corporation
                                                             T. Hastings
                                                       Xerox Corporation
                                                              R. Herriot
                                                       Xerox Corporation
                                                                H. Lewis
                                                         IBM Corporation
                                                           March 1, 2000

    Internet Printing Protocol (IPP): Job and Printer Set Operations



Status of this Memo

This document is an Internet-Draft and is in full conformance with all
provisions of Section 10 of [RFC2026].  Internet-Drafts are working
documents of the Internet Engineering Task Force (IETF), its areas, and
its working groups.  Note that other groups may also distribute working
documents as Internet-Drafts.

Internet-Drafts are draft documents valid for a maximum of six months
and may be updated, replaced, or obsoleted by other documents at any
time.  It is inappropriate to use Internet-Drafts as reference material
or to cite them other than as "work in progress".

The list of current Internet-Drafts can be accessed at
http://www.ietf.org/ietf/1id-abstracts.txt

The list of Internet-Draft Shadow Directories can be accessed as
http://www.ietf.org/shadow.html.

                                Abstract

This document specifies 3 additional OPTIONAL operations for use with
the Internet Printing Protocol/1.0 (IPP) [RFC2565, RFC2566], IPP/1.1
[ipp-mod, ipp-pro], and future versions.  The first is the Set-Printer-
Attributes operation that operators/administrators may perform on a
Printer object to change Printer attribute values. The second is the
Set-Job-Attributes operation that end-users may perform on their jobs
and operators/administrators may perform on any job, depending on
circumstances. The operation changes the Job attribute values. The third
is the Get-Printer-Supported-Values operation that
operators/administrators may perform on a Printer object in order to
determine acceptable values for setting "xxx-supported" attributes using
the Set-Printer-Attributes operation.

A Printer implementation can make the value of some attributes dependent
on the document-format, e.g. "resolution-supported".

Two operation attributes:  "printer-message-from-operator" (text) and
"job-message-from-operator" (text) are defined to set the corresponding
IPP/1.1 Printer and Job Description attributes with the same names.   A
new out-of-band value 'any-value' is added which may be used with any


Kugler, Hastings, Herriot, Lewis                               [Page 1]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


attribute syntax if an attribute definition allows.  The 'any-value'
value used with the 'name' attribute syntax can be (one of) the values
of "xxx-supported" attributes whose attribute syntaxes include both
'keyword' and 'name'.  The 'any-value' value with the 'name' attribute
syntax matches any name supplied by the client during validation.

New Printer Description attributes are defined:
     printer-settable-attributes-supported (1setOf type2 keyword)
     job-settable-attributes-supported (1setOf type2 keyword)
     document-format-varying-attributes (1setOf type2 keyword)
     printer-message-time (integer(MIN:MAX))
     printer-message-date-time (dateTime)

A new status code is defined: 'client-error-attributes-not-settable'.

A 'delete-attribute' out-of-band attribute value is defined for use by
the client in the Set-Job-Attributes request to indicate explicitly that
the Printer is to remove the specified attribute from the Job object.

Finally, the 'not-settable' out-of-band attribute value is defined for
returning in the Set-Printer-Attributes and Set-Job-Attributes operation
responses.

The scope of IPP is characterized in RFC2526 "Design Goals for an
Internet Printing Protocol".  It is not the intent of this document to
revise or clarify this scope or conjecture as to the degree of industry
adoption or trends related to IPP within printing systems.  It is the
intent of this document to extend the original set of operations - in a
similar fashion to the Set1 extensions which referred to IPP/1.0 and
were later incorporated into IPP/1.1.


























Kugler, Hastings, Herriot, Lewis                               [Page 2]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


The full set of IPP documents includes:
  Design Goals for an Internet Printing Protocol [RFC2567]
  Rationale for the Structure and Model and Protocol for the Internet
     Printing Protocol [RFC2568]
  Internet Printing Protocol/1.1: Model and Semantics (this document)
  Internet Printing Protocol/1.1: Encoding and Transport [IPP-PRO]
  Internet Printing Protocol/1.1: Implementer's Guide [IPP-IIG]
  Mapping between LPD and IPP Protocols [RFC2569]


The "Design Goals for an Internet Printing Protocol" document takes a
broad look at distributed printing functionality, and it enumerates
real-life scenarios that help to clarify the features that need to be
included in a printing protocol for the Internet.  It identifies
requirements for three types of users: end users, operators, and
administrators.  It calls out a subset of end user requirements that are
satisfied in IPP/1.0.  A few OPTIONAL operator operations have been
added to IPP/1.1.

The "Rationale for the Structure and Model and Protocol for the Internet
Printing Protocol" document describes IPP from a high level view,
defines a roadmap for the various documents that form the suite of IPP
specification documents, and gives background and rationale for the IETF
working group's major decisions.

The "Internet Printing Protocol/1.1: Encoding and Transport" document is
a formal mapping of the abstract operations and attributes defined in
the model document onto HTTP/1.1 [RFC2616].  It defines the encoding
rules for a new Internet MIME media type called "application/ipp".  This
document also defines the rules for transporting over HTTP a message
body whose Content-Type is "application/ipp".  This document defines a
new scheme named 'ipp' for identifying IPP printers and jobs.

The "Internet Printing Protocol/1.1: Implementer's Guide" document gives
insight and advice to implementers of IPP clients and IPP objects.  It
is intended to help them understand IPP/1.1 and some of the
considerations that may assist them in the design of their client and/or
IPP object implementations.  For example, a typical order of processing
requests is given, including error checking.  Motivation for some of the
specification decisions is also included.

The "Mapping between LPD and IPP Protocols" document gives some advice
to implementers of gateways between IPP and LPD (Line Printer Daemon)
implementations.












Kugler, Hastings, Herriot, Lewis                               [Page 3]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


                           Table of Contents


1  Introduction.....................................................6

2  Terminology......................................................6
2.1  Conformance Terminology.......................................6
2.2  Other terminology.............................................6

3  Requirements and Use Cases.......................................7

4  Definition of the Set operations.................................7
4.1  Set-Printer-Attributes Operation..............................8
  4.1.1  Settable and READ-ONLY Printer Description attributes.....9
  4.1.2  Set-Printer-Attributes Request...........................10
  4.1.3  Set-Printer-Attributes Response..........................12
4.2  Set-Job-Attributes Operation.................................13
  4.2.1  Settable and READ-ONLY Job Description attributes........15
  4.2.2  Set-Job-Attributes Request...............................15
  4.2.3  Set-Job-Attributes Response..............................16
4.3  Get-Printer-Supported-Values Operation.......................17

5  New Operation attributes........................................18
5.1  "printer-message-from-operator" (text(127))..................19
5.2  "job-message-from-operator" (text(127))......................20

6  New Printer Description Attributes..............................21
6.1  printer-settable-attributes-supported (1setOf type2 keyword).21
6.2  job-settable-attributes-supported (1setOf type2 keyword).....21
6.3  document-format-varying-attributes (1setOf type2 keyword)....21
6.4  printer-message-time (integer(MIN:MAX))......................22
6.5  printer-message-date-time (dateTime).........................22

7  Additional status codes.........................................22
7.1  'client-error-attributes-not-settable' (0x0413)..............23

8  Additional out-of-band values...................................23
8.1  'not-settable' out-of-band value.............................23
  8.1.1  Encoding of the 'not-settable' out-of-band attribute value23
8.2  'delete-attribute' out-of-band value.........................23
  8.2.1  Encoding of the 'delete-attribute' out-of-band value.....24
8.3  'any-value' out-of-band attribute value......................24
  8.3.1  Encoding of the 'any-value' out-of-band attribute value..24

9  Conformance Requirements........................................24

10 IANA Considerations.............................................26

11 Internationalization Considerations.............................26

12 Security Considerations.........................................26

13 Author's Addresses..............................................27



Kugler, Hastings, Herriot, Lewis                               [Page 4]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


14 References......................................................27

15 Change History..................................................28
15.1 Changes to the January 30, 2000 version to make the March 1, 2000
version     28
15.2 Changes to the January 20, 2000 version to make the January 30,
2000 version30
15.3 Changes to the January 4, 2000 version to make the January 20,
2000 version30
15.4 Changes to the December 8, 1999 version to make the January 4,
2000 version31

16 Appendix A: Allowed Values for Set-Printer-Attributes...........32

17 Appendix B: Attributes returned from Get-Printer-Supported-Values36

18 Appendix C: Full Copyright Statement............................39


                            Table of Tables

Table 1 - Operation-Id assignments....................................8
Table 2 - Job State Transition Table for the Set-Job-Attributes
   operation........................................................14
Table 3 - Values allowed for Job Template Attributes in the Set-Job-
   Attributes Operation.............................................33
Table 4 - Values allowed for Job Description Attributes in the Set-Job-
   Attributes Operation.............................................33
Table 5 - Values allowed for Printer Job Template Attributes in the Set-
   Printer-Attributes Operation.....................................34
Table 6 - Values allowed for Printer Description Attributes in the Set-
   Printer-Attributes Operation.....................................35
Table 7 - Printer Job Template Attributes returned from Get-Printer-
   Supported-Values.................................................36
Table 8 - Printer Job Template Attributes returned from Get-Printer-
   Supported-Values.................................................37
Table 9 - Printer Description Attributes returned from Get-Printer-
   Supported-Values.................................................37
Table 10 - Printer Job Template Attributes returned from Get-Printer-
   Supported-Values.................................................37
Table 11 - Printer Job Template Attributes returned from Get-Printer-
   Supported-Values.................................................37
Table 12 - Printer Description Attributes returned from Get-Printer-
   Supported-Values.................................................38
Table 13 - Printer Description Attributes returned from Get-Printer-
   Supported-Values.................................................39
Table 14 - Printer Description Attributes returned from Get-Printer-
   Supported-Values.................................................39








Kugler, Hastings, Herriot, Lewis                               [Page 5]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


1  Introduction


The Internet Printing Protocol (IPP) is an application level protocol
that can be used for distributed printing using Internet tools and
technologies.  IPP version 1.1 [ipp-mod, ipp-pro] focuses on end user
functionality with a few administrative operations included.  This
document defines additional OPTIONAL end user, operator, and
administrator Set-Job-Attributes and Set-Printer-Attributes operations
used to modify IPP Job objects and Printer objects.  It also defines a
third Get-Printer-Supported-Values operation that returns values that
the IPP Printer will accept for setting its "xxx-supported" attributes.
The Get-Printer-Supported-Values operation MUST be supported, if the
Set-Printer-Attributes operation is supported.

This document is an extension to IPP/1.0 [RFC2565, RFC2566] and IPP/1.1
[ipp-mod, ipp-pro], and future versions.



2  Terminology

This section defines terminology used throughout this document.

2.1 Conformance Terminology


Capitalized terms, such as MUST, MUST NOT, REQUIRED, SHOULD, SHOULD NOT,
MAY, NEED NOT, and OPTIONAL, have special meaning relating to
conformance.  These terms are defined in [ipp-mod] section 12.1 on
conformance terminology, most of which is taken from RFC 2119 [RFC2119].

The following specialization of these terms apply to this document:

  REQUIRED: if an implementation supports the extensions described in
     this document, it MUST support a REQUIRED feature.
  OPTIONAL: if an implementation supports the extensions described in
     this document, it MAY support an OPTIONAL feature.

2.2 Other terminology


This document uses terms such as Job object (or Job), IPP Printer object
(or Printer), "operation", "request", response", "attributes",
"keywords", and "support".  These terms have special meaning and are
defined in the model terminology [ipp-mod] section 12.2.  The following
additional terms are introduced in this document:

  READ-ONLY:  used in an attribute definition to indicate that the
     attribute MUST NOT be settable using an IPP protocol Set operation.
     In other words, the attribute is not settable by definition.
  not-settable:  an implementation does not support setting an
     attribute (whether or not the attribute's definition is READ-ONLY).





Kugler, Hastings, Herriot, Lewis                               [Page 6]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


3  Requirements and Use Cases


The following requirements and usage are intended to be met by the
specification in this document.

1.The end-user and the operator need a way to modify a Job that is in
  the 'pending' or 'pending-held' state.

  Usage:  The end-user discovers that he/she forgot to include a print
  instruction, such as "finishings" = 'staple' after submitting a job.
  Rather than canceling the job and resubmitting it to the same IPP
  Printer, the end-user is able to modify the job on the IPP Printer.

  The operator needs to modify a job because it is requesting a
  particular kind of media for which there is no more, but the policy
  is to print the job on a comparable medium.

2.The system administrator needs a way to re-configure or change the
  policy of the IPP Printer remotely.

  Usage:  The system administrator is adding additional media to the
  supported media list.

  The system administrator is reducing the capability of the IPP
  Printer by removing one of the operations from the supported
  operations list, such as Cancel-Job, because the policy is to run the
  IPP Printer like a public facsimile machine.

  The system administrator is remotely configuring the IPP Printer
  after installing it, and so is replacing the Printer Description
  attributes that have the out-of-band 'no-value' value (see [ipp-mod]
  section 4.1) with the proper values.

  The operator is changing the media loaded in the input tray and so is
  replacing the "media-ready" Job Template Printer attribute value with
  the proper values



4  Definition of the Set operations


The Set-Printer-Attributes operation (as are all Printer operations) are
directed at Printer objects.  A client MUST always supply the "printer-
uri" operation attribute in order to identify the correct target of the
operation.  These descriptions assume all of the common semantics of
IPP/1.1 Model and Semantics document [ipp-mod] section 3.1.

The Set-Job-Attributes operation (as are all Job operations) are
directed at Job objects.  A client MUST always supply some means of
identifying the Job object in order to identify the correct target of
the operation.  That job identification MAY either be a single Job URI
or a combination of a Printer URI with a Job ID as defined in [ipp-mod].
The IPP object implementation MUST support both forms of identification


Kugler, Hastings, Herriot, Lewis                               [Page 7]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


for every job. If possible, a client SHOULD use the Printer URI with a
Job ID rather than a Job URI, since the 32-bit "job-id" is more readily
translated to and from other print protocols that MAY be serving as
gateways into or out of the IPP implementation.

The Set Printer operations are summarized in Table 1:

                   Table 1 - Operation-Id assignments

  Operation Name       Operation  Brief description
                       -Id
  Set-Printer-         0x0013     Sets attribute values of the target
  Attributes                      Printer object
  Set-Job-Attributes   0x0014     Sets attribute values of the target
                                  Job object
  Get-Printer-         0x0015     Gets values that are valid for
  Supported-Values                setting "xxx-supported" attributes
                                  using the Set-Printer-Attributes
                                  operation

4.1 Set-Printer-Attributes Operation


This OPTIONAL operation allows a client to set the values of the
attributes of a Printer object.   In the request, the client supplies
the set of Printer attribute name keywords and values that are to be
set.  In the response, the Printer object returns success or rejects the
entire request with indications of which attribute or attributes could
not be set.

The Printer object validates the client-supplied attributes in the Set-
Printer-Attributes request.  For an attribute to validate it MUST meet
all of the following rules:

  1. The number of attributes supplied by the client MUST NOT exceed the
     maximum number that the Printer supports in a Set-Printer-
     Attributes request.  A Printer MUST accept at least one attribute,
     but SHOULD accept a reasonable number in a single Set-Printer-
     Attributes request.  If a Printer supports setting the three
     "parallel" Printer Description attributes ("printer-uri-supported",
     "uri-authentication-supported", and "uri-security-supported" (see
     [ipp-mod] sections 4.4.1 through 4.4.3), then the Printer MUST
     accept at least three attributes in a Set-Printer-Attributes
     request.

     Note:  There is no way for the client to determine the maximum
     number of attributes that the Printer supports in a Set-Printer-
     Attributes request, except to try a reasonable number.

  2. The Printer MUST support the attribute.

  3. The attribute MUST NOT be READ-ONLY, i.e., the definition of the
     attribute MUST NOT indicate that the attribute is READ-ONLY (see
     Appendix A for an indication of which IPP/1.1 attributes are READ-
     ONLY).

Kugler, Hastings, Herriot, Lewis                               [Page 8]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


  4. The attribute MUST be settable in this implementation.

  5. The Printer MUST support the value according to the rules defined
     in Appendix A.

  6. The attribute's values MUST NOT conflict with other Printer
     attribute, including ones being set in this same operation.

If any of the supplied attributes does not validate, the Printer object
MUST reject the entire operation; the Printer object MUST NOT partially
set some of the supplied attributes.  In other words, after the
operation, all the supplied attributes MUST be set or none of them MUST
be set, thus making the Set-Printer-Attributes an atomic operation.

The Printer MUST accept this operation when its READ-ONLY "printer-
state" attribute (see ipp-mod] section 4.4.11) is 'idle' or 'stopped',
and SHOULD accept it when the value is 'processing'.  The Printer MUST
accept this operation for any of the values of the Printer object's
READ-ONLY "printer-state-reasons" and "printer-is-accepting-jobs"
attributes, unless explicitly defined otherwise in the definition of
these attributes' values.

This operation MUST NOT change the value of attributes not specified in
the operation unless the definition of the attribute explicitly
specifies such side-effects.  For example, this document explicitly
specifies that when this operation sets "printer-message-from-operator",
the Printer also MUST set the READ-ONLY "printer-message-time" and READ-
ONLY "printer-message-date-time" attributes to the time of the operation
as a side effect .  In particular, if this operation changes an "xxx-
default" attribute, the new value MUST be in the "xxx-supported"
attribute or the request MUST contain a new value for "xxx-supported"
which contains the new value for the "xxx-default".  Otherwise, the
Printer MUST reject the operation.  In general, Printer attribute
definitions that are settable will not define side-effects on other
attributes that are settable, only side effects on READ-ONLY attributes,
if any.


4.1.1Settable and READ-ONLY Printer Description attributes

If the Printer supports the Set-Printer-Attributes operation, then it
SHOULD support setting of:

     all Job Template Default ("xxx-default") attributes
     all Job Template Supported ("xxx-supported") attributes
     all Job Template Ready ("xxx-ready") attributes

that the implementation supports (see [ipp-mod] section 4.2 and
extensions).

Some Printer Description attributes (see [ipp-mod] section 4.4) MUST NOT
be settable, i.e., they are defined to be READ-ONLY.  An attribute
marked as "READ-ONLY" in the Printer Description attribute table in
Appendix A is such an attribute.  The Printer attributes that are not



Kugler, Hastings, Herriot, Lewis                               [Page 9]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


marked as "READ-ONLY" MAY be settable using the Set-Printer-Attributes
operation, depending on implementation.

Note:  From now on, all extensions that define new object attributes
will indicate whether or not the attributes are READ-ONLY, by including
the "READ-ONLY" adjective in their descriptions and/or explicitly
stating whether they MAY be settable.

If "xxx-supported" Printer Description attribute are settable, then they
MUST affect the behavior of the implementation.  If they are READ-ONLY
then they reflect the implementation and cannot be changed explicitly
using the Set-Printer-Attributes operation.  Consider the following
example:

     For example, if the "operations-supported" Printer Description
     attribute (see [ipp-mod] section 4.4.15) is settable in a
     particular implementation, then changing its value with a Set-
     Printer-Attributes operation MUST affect the operations that the
     implementation accepts or rejects.  Such an implementation will
     need to be able to reject values for operations that it contains no
     code support for (see section 5).  If the "operations-supported"
     Printer Description attribute is not settable in a particular
     implementation, then that implementation MUST reject an attempt to
     set it with a Set-Printer-Attributes operation, return the 'client-
     error-attributes-not-settable' status code (see section 7.1), and
     return the "operations-supported" attribute with the out-of-band
     'not-settable' value in the Unsupported Attributes Group.

Access Rights:  The authenticated user (see [ipp-mod] section 8.3)
performing this operation must be an operator or administrator of the
Printer object (see [ipp-mod] Sections 1 and 8.5).  Most Printer
attributes will require administrator privileges to set, such as "xxx-
supported", while some will require operator privileges only, such as
"media-ready" and "printer-message-from-operator".  Which attributes
require which privileges depends on implementation and MAY depend on
site policy.


4.1.2Set-Printer-Attributes Request

The following sets of attributes are part of the Set-Printer-Attributes
Request:

Group 1: Operation Attributes

  Natural Language and Character Set:
     The "attributes-charset" and "attributes-natural-language"
     attributes as described in [ipp-mod] section 3.1.4.1.

  Target:
     The "printer-uri" (uri) operation attribute which is the target for
     this operation as described in [ipp-mod] section 3.1.5.




Kugler, Hastings, Herriot, Lewis                              [Page 10]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


  Requesting User Name:
     The "requesting-user-name" (name(MAX)) attribute SHOULD be supplied
     by the client as described in [ipp-mod] section 8.3.

  "document-format" (mimeMediaType):
     The client OPTIONALLY supplies this attribute.  The Printer object
     MUST support this attribute.  This attribute is useful for a client
     to select the document-format to which the attribute modification
     should be applied.  A Printer implementation MAY allow some
     attributes to have different values for each document format that
     it supports. See [ipp-mod] section 3.2.5.1 "Get-Printer-Attributes
     Request".

     If the client includes this attribute, the Printer MUST change the
     supplied attributes for the document format specified by this
     attribute.  If a supplied attribute is a member of the "document-
     format-varying-attributes" (i.e., the attribute varies by document
     format, see section 6.3), the Printer MUST change the supplied
     attribute for the document format specified by this attribute, but
     not for other document formats.  If a supplied attribute isn't a
     member of the "document-format-varying-attributes" (i.e. it doesn't
     vary by document format), the Printer MUST change the supplied
     attribute for all document formats.

     If the client omits this attribute, the Printer MUST change the
     supplied attributes for all document formats whether or not they
     vary by document-format.

     If the client supplies a value for the "document-format" Operation
     attribute that is either 'application/octet-stream' or not
     supported by the Printer, i.e., is not among the values of the
     Printer object's "document-format-supported" attribute, the Printer
     object MUST reject the operation and return the 'client-error-
     document-format-not-supported' status code.  Note: the document-
     format 'application/octet-stream' is the union of several document-
     formats (see [ipp-mod] section 3.2.5.1, Get-Printer-Attributes) and
     is not a true document-format.


Group 2: Printer Attributes

     The client MUST supply a set of Printer attributes with one or more
     values (including explicitly allowed out-of-band values) as defined
     in [ipp-mod] section 4.2 Job Template Attributes ("xxx-default",
     "xxx-supported", and "xxx-ready" attributes), section 4.4 Printer
     Description Attributes, and any attribute extensions supported by
     the Printer.  The value(s) of each Printer attribute supplied in
     Group 2 replaces the value(s) of the corresponding Printer
     attribute on the target Printer object.  For attributes that can
     have multiple values (1setOf), all values supplied by the client
     replace all values of the corresponding Printer object attribute.
     If a Printer object attribute had not been configured yet and so
     had the 'no-value' out-of-band value (see [ipp-mod] section 4.1),
     the supplied value(s) replace the 'no-value' value.


Kugler, Hastings, Herriot, Lewis                              [Page 11]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


4.1.3Set-Printer-Attributes Response

The Printer object returns the following sets of attributes as part of
the Get-Printer-Attributes Response:

Group 1: Operation Attributes

  Status Message:
     In addition to the REQUIRED status code returned in every response,
     the response OPTIONALLY includes a "status-message" (text(255))
     and/or a "detailed-status-message" (text(MAX)) operation attribute
     as described in [ipp-mod] sections 13 and 3.1.6.

  Natural Language and Character Set:
     The "attributes-charset" and "attributes-natural-language"
     attributes as described in [ipp-mod] section 3.1.4.2.


Group 2: Unsupported Attributes

     See [ipp-mod] section 3.1.7 for details on returning Unsupported
     Attributes.

     If some of the attributes in the operation fail to validate, the
     Printer MUST reject the operation, MUST NOT change any Printer
     attributes, and MUST return the indicated status code below.  In
     this group, the Printer MUST also return all attributes that fail
     to validate.  The following are the reasons that an attribute fails
     to validate and the value returned for the attribute, along with
     the indicated status code and order of detection:

       1. The number of attributes supplied by the client exceeds the
          maximum number that the Printer supports in a Set-Printer-
          Attributes request:  return the 'client-error-request-entity-
          too-large' (see [ipp-mod] section 13.1.4.9).

       2. The Printer doesn't support the attribute:  return the
          attribute with the "out-of-band" value 'unsupported' (see
          [ipp-mod] section 3.1.7 and [ipp-pro]) and the 'client-error-
          attributes-or-values-not-supported (see [ipp-mod] section
          13.1.4.12).

       3. The attribute is either READ-ONLY (in its definition) or is
          not-settable in this implementation:  return the attribute
          with the "out-of-band" value 'not-settable' (see section 8.1)
          and the 'client-error-attributes-not-settable' status code
          (see section 7.1).

       4. The Printer doesn't support the value:  if the attribute in
          the operation has a single value return it.  If the attribute
          in the operation is multi-valued, return only those values in
          a 1setOf that are not supported.  Return the 'client-error-
          attributes-or-values-not-supported' status code (see [ipp-mod]
          section 13.1.4.12).



Kugler, Hastings, Herriot, Lewis                              [Page 12]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


       5. The values of some of the supplied attributes conflict with
          one another and/or other Printer attribute values not being
          set:  if the conflicting attribute in the operation has a
          single value return the attribute and the value.  If the
          attribute in the operation is multi-valued, return only the
          attribute and those values in a 1setOf that are conflicting
          with other attributes.  Return the 'client-error-conflicting-
          attributes' status code (see [ipp-mod] section 13.1.4.15).


4.2 Set-Job-Attributes Operation


This OPTIONAL operation allows a client to set the values of the
attributes of a Job object.  In the request, the client supplies the set
of Job attribute name keywords and values that are to be set.  In the
response, the IPP object returns success or rejects the entire request
with indications of which attribute or attributes could not be set.

This operation is almost identical to the Set-Printer-Attributes
operation (see section 4.1).  The only differences are that the Set-Job-
Attributes operation is directed at a Job object rather than a Printer
object, there is no "document-format" operation attribute used when
setting a Job object, the operation can add an attribute to the (Job)
object, the 'delete-attributes' out-of-band value is permitted to remove
an attribute, and the validation is the same as the Job Creation
operations (Print-Job, Print-URI, and Create-Job), i.e., depends on the
"xxx-supported" Printer Description attributes (see [ipp-mod] section
3.1).

If a client supplies a job attribute in a Set-Job-Attributes request
that the Printer supports, and the job was originally submitted without
supplying that attribute, the Printer adds the attribute to the Job
object.

If the client supplies a job attribute with the "out-of-band" value
'delete-attribute' (see section 8.2), then the Printer MUST remove the
attribute and all of its values from the Job object, if present.  The
semantic effect of the client supplying the 'delete-attribute' value in
a Set-Job-Attributes operation MUST be the same as if the attribute had
not been supplied with the Job object in the Job Creation operation,
i.e., the Printer applies its default attribute or behavior with lower
precedence that the PDL (see the beginning of [ipp-mod] section 4.2 and
[ipp-mod] 3.2.1.1).  Any subsequent query of the Job object using Get-
Job-Attributes or Get-Jobs MUST NOT return any attribute that has been
deleted using the 'delete-attribute' out-of-band value.  However, a
client can re-establish such a deleted Job attribute with any supported
value(s) using a subsequent Set-Job-Attributes operation.

If the client supplies an attribute in a Set-Job-Attributes request with
the 'delete-attribute' value and that attribute is not present on the
Job object, the Printer ignores that supplied attribute in the request,
does not return the attribute in the Unsupported Attributes group, and
returns the 'successful-ok' status code, if there are no other problems
with the request.

Kugler, Hastings, Herriot, Lewis                              [Page 13]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


The validation of the Set-Job-Attributes request is performed by the
Printer as if the job had been submitted originally with the new
attribute values (and the deleted attributes removed) and with "ipp-
attribute-fidelity" set to 'true', i.e., all modified attributes Job
attributes and values MUST be supported in combination with the Job
attributes not modified.  If such a Job Creation operation would have
been accepted, then the Set-Job-Attributes MUST be accepted.  If such a
Job Creation operation would have been rejected, then the Set-Job-
Attributes MUST be rejected and the Job MUST be unchanged.  In addition,
if any of the supplied attributes are not supported, are not settable,
or the values are not supported, the Printer object MUST reject the
entire operation; the Printer object MUST NOT partially set some of the
supplied attributes.  In other words, after the operation, all the
supplied attributes MUST be set or none of them MUST be set, thus making
the Set-Job-Attributes an atomic operation.

The IPP object MUST accept or reject this operations when the Job's
READ-ONLY "job-state" attribute has the values shown in Table 2.  The
job's current state MUST affect whether the IPP object accepts or
rejects the request. For example, in the case where the operation
creates a request for unavailable resources, the Job transitions to a
new state.  Table 2 shows the allowed behaviors in each job state and
the transitions.

    Table 2 - Job State Transition Table for the Set-Job-Attributes
                               operation

   Current "job-    New "job-     IPP object's response status
       state"         state"             code and action:

  'pending'       'pending'      'successful-ok'
  'pending'       'pending-      'successful-ok' - needed
                  held'          resources are not ready
  'pending-held'  'pending-      'successful-ok'
                  held'
  'pending-held'  'pending'      'successful-ok' - needed
                                 resources are ready
  'processing'    'processing'   'successful-ok'  or 'client-
                                 error-not-possible' depending on
                                 implementation, including the
                                 attributes being set, whether
                                 the job has started marking
                                 media, etc.
  'processing-    'processing-   'successful-ok'  or 'client-
  stopped'        stopped'       error-not-possible' depending on
                                 implementation, including the
                                 attributes being set, whether
                                 the job has started marking
                                 media, etc.
  'completed'     'completed'    'client-error-not-possible'
  'canceled'      'canceled'     'client-error-not-possible'
  'aborted'       'aborted'      'client-error-not-possible'




Kugler, Hastings, Herriot, Lewis                              [Page 14]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


This operation MUST NOT change the value of attributes not specified in
the operation unless the definition of the attribute explicitly
specifies such side-effects.  In general, Job attribute definitions that
are settable will not define side-effects on other attributes that are
settable, only side effects on READ-ONLY attributes, if any.


4.2.1Settable and READ-ONLY Job Description attributes

If the Printer supports the "job-message-from-operator" Job Description
attribute (see [ipp-mod] section 4.3.16) and the client explicitly
supplies a new value for the "job-message-from-operator" in the Set-Job-
Attributes request, then the Printer MUST set the "job-message-from-
operator" Job attribute to this new value.

If the Printer supports the Set-Job-Attributes operation, then it SHOULD
support setting of:

     all Job Template job ("xxx") attributes

that the implementation supports (see [ipp-mod] section 4.2 and
extensions).

Some Job Description attributes (see [ipp-mod] section 4.3) MUST NOT be
settable, i.e., they are defined to be READ-ONLY.  An attribute marked
as "READ-ONLY" in the Job Description attribute table in Appendix A is
such an attribute.  The Job attributes not marked as "READ-ONLY" MAY be
settable using the Set-Job-Attributes operation, depending on
implementation.

Note:  From now on, all extensions that define new object attributes
will indicate whether or not the attributes are READ-ONLY, by including
the "READ-ONLY" adjective in their descriptions and/or explicitly
stating whether they MAY be settable.

Access Rights: The authenticated user (see [ipp-mod] section 8.3)
performing this operation must either be the job owner (as determined in
the Job Creation operation) or an operator or administrator of the
Printer object (see [ipp-mod] Sections 1 and 8.5).


4.2.2Set-Job-Attributes Request

The following sets of attributes are part of the Set-Job-Attributes
Request:

Group 1: Operation Attributes

  Natural Language and Character Set:
     The "attributes-charset" and "attributes-natural-language"
     attributes as described in [ipp-mod] section 3.1.4.1.

  Target:
     Either (1) the "printer-uri" (uri) plus "job-id" (integer(1:MAX))
     or (2) the "job-uri" (uri) operation attribute(s) which define the
     target for this operation as described in [ipp-mod] section 3.1.5.


Kugler, Hastings, Herriot, Lewis                              [Page 15]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000



  Requesting User Name:
     The "requesting-user-name" (name(MAX)) attribute SHOULD be supplied
     by the client as described in [ipp-mod] section 8.3.


Group 2: Job Attributes

     The client MUST supply a set of Job attributes with one or more
     values (including explicitly allowed out-of-band values) as defined
     in [ipp-mod] section 4.2 Job Template Attributes ("xxx"
     attributes), section 4.3 Job Description Attributes, and any
     attribute extensions supported by the Printer.  The value(s) of
     each Job attribute supplied in Group 2 replaces the value(s) of the
     corresponding Job attribute on the target Job object.  For
     attributes that can have multiple values (1setOf), all values
     supplied by the client replace all values of the corresponding Job
     object attribute.

     If the client supplies an "xxx" attribute with the 'delete-
     attribute' out-of-band value (see section 8.2), the Printer MUST
     remove the "xxx" attribute from the Job object, if present.


4.2.3Set-Job-Attributes Response

The IPP object returns the following sets of attributes as part of the
Set-Job-Attributes Response:

Group 1: Operation Attributes

  Status Message:
     In addition to the REQUIRED status code returned in every response,
     the response OPTIONALLY includes a "status-message" (text(255))
     and/or a "detailed-status-message" (text(MAX)) operation attribute
     as described in [ipp-mod] sections 13 and 3.1.6.

  Natural Language and Character Set:
     The "attributes-charset" and "attributes-natural-language"
     attributes as described in [ipp-mod] section 3.1.4.2.


Group 2: Unsupported Attributes

     See [ipp-mod] section 3.1.7 for details on returning Unsupported
     Attributes.

     If some of the attributes in the operation fail to validate, the
     Printer MUST reject the operation, MUST NOT change any Job
     attributes, and MUST return the indicated status code below.  In
     this group, the Printer MUST also return all attributes that fail
     to validate.  The following are the reasons that an attribute fails
     to validate and the value returned for the attribute, along with
     the indicated status code and order of detection:

       1. The number of attributes supplied by the client exceeds the
          maximum number that the Printer supports in a Set-Printer-

Kugler, Hastings, Herriot, Lewis                              [Page 16]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


          Attributes request:  return the 'client-error-request-entity-
          too-large' (see [ipp-mod] section 13.1.4.9).

       2. The Printer doesn't support the attribute:  return the
          attribute with the "out-of-band" value 'unsupported' (see
          [ipp-mod] section 3.1.7 and [ipp-pro]) and the 'client-error-
          attributes-or-values-not-supported (see [ipp-mod] section
          13.1.4.12).

       3. The attribute is READ-ONLY (in its definition) or is not-
          settable in this implementation:  return the attribute with
          the "out-of-band" value 'not-settable' (see section 8.1) and
          the 'client-error-attributes-not-settable' status code (see
          section 7.1).

       4. The Printer doesn't support the value:  if the attribute in
          the operation has a single value return it.  If the attribute
          in the operation is multi-valued, return only those values in
          a 1setOf that are not supported.  Return the 'client-error-
          attributes-or-values-not-supported' status code (see [ipp-mod]
          section 13.1.4.12).

       5. The values of some of the supplied attributes conflict with
          one another and/or other Job attribute values not being set:
          if the conflicting attribute in the operation has a single
          value return the attribute and the value.  If the attribute in
          the operation is multi-valued, return only the attribute and
          those values in a 1setOf that are conflicting with other
          attributes.  Return the 'client-error-conflicting-attributes'
          status code (see [ipp-mod] section 13.1.4.15).


4.3 Get-Printer-Supported-Values Operation


This OPTIONAL operation allows a client to request the values that the
Printer allows in the Set-Printer-Attributes operation for "xxx-
supported" attributes.  If the Printer supports the Set-Printer-
Attributes operation AND some of its "xxx-supported" Printer attributes
are settable, then the Printer MUST also support this operation.  This
operation has identical request/response attributes to the Get-Printer-
Attributes operation in IPP/1.1 [ipp-mod].  The operation also behaves
identically to the Get-Printer-Attributes operation in IPP/1.1 [ipp-mod]
with the following exceptions:

  1. The Get-Printer-Supported-Values operation supports only "xxx-
     supported" attributes.

  2. The Get-Printer-Attributes operation returns the current value of
     specified attributes while the Get-Printer-Supported-Values
     operation returns values that permit a client to determine what
     values of "xxx-supported" attributes the Printer supports in the
     Set-Printer-Attributes operation.



Kugler, Hastings, Herriot, Lewis                              [Page 17]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


  3. The Get-Printer-Supported-Values operation does not return any
     'name' attribute syntax values for any "xxx-supported" attributes.
     Instead, if the Set-Printer-Attributes operation will accept (any)
     name value for an "xxx-supported" attribute, then the Get-Printer-
     Supported-Values operation MUST return the 'any-value' out-of-band
     attribute value with the 'name' attribute syntax (see section 8.3)
     as one of the values of the "xxx-supported" attribute.  In other
     words, the 'any-value' out-of-band attribute value used in
     combination with the 'name' attribute syntax indicates that the
     Printer implementation supports clients setting 'name' attribute
     syntax values for "xxx-supported" attributes that are defined with
     the 'name' attribute syntax.

For example, if the Get-Printer-Supported-Values operation returns
several keywords as the value of the "media-supported" attribute, then
the Set-Printer-Attributes operation MUST accept any of these keywords
as values for the "media-supported" attribute.  If the Get-Printer-
Supported-Values operation returns an 'any-value' out-of-band attribute
value with the 'name' attribute syntax as one of the values of the
"media-supported" attribute, then the Set-Printer-Attributes operation
MUST accept any value whose attribute syntax is 'name' as values for the
"media-supported" attribute.

The Get-Printer-Supported-Values MAY return the 'any-value' out-of-band
attribute value in combination with the 'name' attribute syntax for any
of the following IPP/1.1 attributes in which case the Printer MUST
accept any 'name' value in a Set-Printer-Attributes operation that is
setting that attribute:

     media-supported
     job-hold-until-supported
     job-sheets-supported

If the 'any-value' out-of-band attribute value in combination with the
'name' attribute syntax is not one of the values of an "xxx-supported"
attribute returned in a Get-Printer-Supported-Values response, then the
Printer MUST NOT allow the Set-Printer-Attributes operation for that
attribute to contain a value whose attribute syntax is 'name'.

See Appendix B for a full list of values returned by this operation.



5  New Operation attributes


This section defines new operation attributes for use with the IPP/1.1
operations indicated.  As new operations are defined they will also
indicate explicitly whether these operation attributes are defined for
use with them.







Kugler, Hastings, Herriot, Lewis                              [Page 18]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


5.1 "printer-message-from-operator" (text(127))


The Printer SHOULD support this Operation attribute in following
operations if it supports the corresponding "printer-message-from-
operator" Printer Description attribute.

     Pause-Printer
     Resume-Printer
     Purge-Jobs

The client OPTIONALLY supplies this attribute in the above operations.
The value of this attribute is a message from the operator about the
Printer object on which the operator is performing the operation.  If
this operation attribute is supported, the Printer copies the value to
its "printer-message-from-operator" Printer Description attribute (see
[ipp-mod] section 4.4.25) even if this Operation attribute is a zero-
length text value or consists solely of white space.

If the Printer supports this operation attribute, it MUST support both a
zero-length text value and the 'no-value' out-of-band value (see [ipp-
mod] section 4.1) to indicate that the operator has sent no message.  In
this case, the Printer sets the value of the "printer-message-from-
operator" to the zero-length value or 'no-value' out-of-band value,
respectively.  If the client queries the "printer-message-from-operator"
Printer attribute, the Printer returns the attribute with the zero-
length value or the 'no-value' value, respectively.

In addition, the Printer automatically copies:

  1. the value of its "printer-up-time" attribute (see [ipp-mod] section
     4.4.29) to its "printer-message-time" attribute,

  2. the value of its printer-current-time" (dateTime) attribute (see
     [ipp-mod] section 4.4.30) to its "printer-message-date-time"
     attribute, if supported.

If the client omits this operation attribute, the Printer does not
change the value of its "printer-message-from-operator", "printer-
message-time" and "printer-message-date-time" Printer Description
attributes.

The "printer-message-from-operator" operation attribute MUST NOT be
supported as an operation attribute for the Set-Printer-Attributes
operation.  If the operator wants to set the Printer's "printer-message-
from-operator" Printer Description attribute when issuing the Set-
Printer-Attributes operation, the client supplies the "printer-message-
from-operator" explicitly with its new value as one of the Printer
Description attributes in Group 2 in the request.  The Printer also
updates its "printer-message-time" and "printer-message-date-time"
Printer Description attributes.  If the client does not explicitly
supply the "printer-message-from-operator" with its new value in the
Set-Printer-Attributes request, the Printer leaves the value of the



Kugler, Hastings, Herriot, Lewis                              [Page 19]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


Printer's "printer-message-from-operator" Printer Description attribute
unchanged.


5.2 "job-message-from-operator" (text(127))


The Printer SHOULD support this Operation attribute in following
operations if it supports the corresponding "job-message-from-operator"
Job Description attribute.

     Cancel-Job
     Hold-Job
     Release-Job
     Restart-Job

The client OPTIONALLY supplies this attribute in the above operations.
The value of this attribute is a message from the operator about the Job
object on which the operator has just performed an operation.  If
supported, the Printer copies the value to the Job's "job-message-from-
operator" Job Description attribute (see [ipp-mod] section 4.3.16) (even
if this Operation attribute is a zero-length text value or consists
solely of white space).

If the Printer supports this operation attribute, it MUST support both a
zero-length text value and the 'no-value' out-of-band value (see [ipp-
mod] section 4.1) to indicate that the operator has sent no message.  In
this case, the Printer sets the value of the "job-message-from-operator"
to the zero-length value or 'no-value' out-of-band value, respectively.
If the client queries the "job-message-from-operator" Job attribute, the
IPP object returns the attribute with the zero-length value or the 'no-
value' value, respectively.

If the client omits this attribute, the Printer does not change the
value of its "job-message-from-operator" Job Description attribute.

Note:  There are no corresponding 'job-message-time" and "job-message-
date-time" Job Description attributes, since the usual lifetime of a job
is limited.

The "job-message-from-operator" operation attribute MUST NOT be
supported as an operation attribute for the Set-Job-Attributes
operation.  If the operator wants to set the Job's "job-message-from-
operator" Job Description attribute when issuing the Set-Job-Attributes
operation, the client MUST supply the "job-message-from-operator" with
its new value as one of the Job Description attributes in Group 2 in the
request.  Otherwise, the Printer leaves the value of the Job's "job-
message-from-operator" Job Description attribute unchanged by not
explicitly setting the attribute.   If the client does not explicitly
supply the "job-message-from-operator" with its new value in the Set-
Job-Attributes request, the Printer leaves the value of the Job's "job-
message-from-operator" Job Description attribute unchanged.




Kugler, Hastings, Herriot, Lewis                              [Page 20]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


6  New Printer Description Attributes


The following new Printer Description attributes are needed to support
the new operations defined in this document.


6.1 printer-settable-attributes-supported (1setOf type2 keyword)


This REQUIRED READ-ONLY Printer attribute identifies the Printer object
attributes that are settable in this implementation, i.e., that are
settable using the Set-Printer-Attributes operations (see section 4.1).
This attribute MUST be supported if the Set-Printer-Attributes
operations is supported.  The Printer MUST reject attempts to set any
Printer attributes that are not one of the values of this attribute,
returning the 'client-error-attributes-not-settable' status code (see
section 7.1).  The value of this attribute MAY depend on the value of
the "document-format" operation attribute supplied in the Get-Printer-
Attributes operation (see [ipp-mod] section 3.2.5.1).

Standard keyword values are:

  'none':  There are no settable Printer attributes.
  'xxx':   Where 'xxx' is any of the keyword attribute names allowed by
     section 4.1.1

6.2 job-settable-attributes-supported (1setOf type2 keyword)


This REQUIRED READ-ONLY Printer attribute identifies the Job object
attributes that are settable in this implementation, i.e., that are
settable using the Set-Job-Attributes operation (see section 4.2).  This
attribute MUST be supported if the Set-Job-Attributes operations is
supported.  The Printer MUST reject attempts to set any Job attributes
that are not one of the values of this attribute, returning the 'client-
error-attributes-not-settable' status code (see section 7.1).

Standard keyword values are:

  'none':  There are no settable Job attributes.
  'xxx':   Where 'xxx' is any of the keyword attribute names allowed by
     section 4.2.1.

6.3 document-format-varying-attributes (1setOf type2 keyword)


This OPTIONAL READ-ONLY Printer Description attribute contains a set of
attribute name keywords.  This attribute SHOULD be supported by a
Printer object, if the Printer object has Printer attributes whose value
vary depending on document format (see [ipp-mod] Get-Printer-Attributes
operation).  This attribute specifies which attribute values can vary by
document-format.  If an attribute's name "xxx" is a member of this
attribute and the value of attribute "xxx" is changed with the Set-
Printer-Attributes operation that included the "document-format"
operation attribute, then the Printer MUST change the value for the
specified document format and no other document formats (see section


Kugler, Hastings, Herriot, Lewis                              [Page 21]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


4.1.2).  If an attribute's name "xxx" is not a member of this attribute
and the value of attribute "xxx" is changed with the Set-Printer-
Attributes operation, then the attribute is changed for all document
formats (whether or not the client supplied the "document-format"
operation attribute).


6.4 printer-message-time (integer(MIN:MAX))


This OPTIONAL READ-ONLY Printer Description attribute contains the time
that the Printer's "printer-message-from-operator" was changed by the
operator using any operation where the client supplied the "printer-
message-from-operator" operation attribute (see section 5.1) or was
explicitly set using the Set-Printer-Attributes operation (see section
4.1).  This attribute allows the users to know when the "printer-
message-from-operator" attribute was last set.

The Printer sets the value of this attribute by copying the value of the
Printer's "printer-up-time" attribute (see [ipp-mod] section 4.3.14).
If the Printer resets its "printer-up-time" attribute to 1 on power-up,
then it MUST change the value of the "printer-message-time" to 0 or a
negative number as specified in [ipp-mod] section 4.3.14.

Note:  This attribute helps users better understand the context for the
"printer-message-from-operator" message.


6.5 printer-message-date-time (dateTime)


This READ-ONLY Printer Description attribute contains the date and time
that the Printer's "printer-message-from-operator" was changed by the
operator using any operation where the client supplied the "printer-
message-from-operator" operation attribute (see section 5.1) or was
explicitly set using the Set-Printer-Attributes operation (see section
4.1).  This attribute allows the users to know when the "printer-
message-from-operator" attribute was last set.

This attribute MUST be supported if the Printer supports both the
"printer-message-time" and the "printer-current-time" (dateTime)
attributes (see [ipp-mod] section 4.4.30).

Note:  This attribute helps users better understand the context for the
"printer-message-from-operator" message.



7  Additional status codes

This section defines new status codes used by the operations defined in
this document.






Kugler, Hastings, Herriot, Lewis                              [Page 22]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


7.1 'client-error-attributes-not-settable' (0x0413)


The Set-Printer-Attributes or Set-Job-Attributes operation failed
because one or more of the specified attributes cannot be set either
because the attribute is defined to be READ-ONLY or the attribute is not
settable in this implementation (see sections 4.1.3 and 4.2.3), the
Printer MUST return this error code and the attribute keyword name(s)
and the 'not-settable' out-of-band value (see section 8.1) in the
Unsupported Attributes Group(see [ipp-mod] section 3.1.7) for all of the
attributes that could not be set. When the Printer returns this status,
it MUST NOT change any of the attributes supplied in the operation.



8  Additional out-of-band values


This section defines additional out-of-band values.  As with all out-of-
band values, a client or a Printer MUST NOT use an out-of-band value
unless the definition of the attribute in an operation request and/or
response explicitly allows such usage.  See the beginning of [ipp-mod]
section 4.1.


8.1 'not-settable' out-of-band value


The 'not-settable' out-of-band value is used by the IPP Printer in the
Unsupported Attributes group of a Set-Job-Attributes or Set-Printer-
Attributes response to indicate that an attribute (supplied by the
client) is READ-ONLY by definition or is not settable in this
implementation (see sections 4.1.3 and 4.2.3).

See sections 4.1.3 and 4.2.3 in this document for an example definition
of the usage of the 'not-settable' out-of-band value in the Set-Printer-
Attributes and Set-Job-Attributes responses.


8.1.1Encoding of the 'not-settable' out-of-band attribute value

The encoding of the 'not-settable' out-of-band value is 0x15 (see [ipp-
pro]).


8.2 'delete-attribute' out-of-band value


The 'delete-attribute' out-of-band value is supplied by the client in
the Set-Job-Attributes request to indicate that the Printer is to remove
the supplied attribute and all of its values from the Job object, if
present (see section 4.2).

The 'delete-attribute' out-of-band value is defined for use with the
Set-Job-Attributes only.  Clients MUST NOT supply and IPP objects MUST
NOT support the 'delete-attribute' out-of-band value in other
operations, such as the Set-Printer-Attributes operation, where the
absence of an attribute from an IPP object indicates that the attribute

Kugler, Hastings, Herriot, Lewis                              [Page 23]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


is not supported.  If a Printer receives this out-of-band value in other
operations, the Printer MUST reject the entire request and return the
'client-error-bad-request' status code and not process any of the other
supplied attributes.

See section 4.2 in this document for an example definition of the usage
of the 'delete-attribute' out-of-band value in the Set-Job-Attributes
request.


8.2.1Encoding of the 'delete-attribute' out-of-band value

The encoding of the 'delete-attribute' out-of-band value is 0x16 (see
[ipp-pro]).


8.3 'any-value' out-of-band attribute value


The 'any-value' out-of-band attribute value MAY be used in combination
with an attribute syntax to represent "any" attribute value of that
attribute syntax.

See section 4.3 in this document for an example definition of the usage
of the 'any-value' out-of-band attribute value with the 'name' attribute
syntax in any "xxx-supported" attribute returned in a Get-Printer-
Supported-Values response.



8.3.1Encoding of the 'any-value' out-of-band attribute value

The encoding of the 'any-value' out-of-band attribute value is 0x17 (see
[ipp-pro]).  This out-of-band value REQUIRES a non-zero length and an
attribute value which identifies an attribute syntax type.  The
attribute value is either (1) a one-octet attribute syntax tag as
defined in [ipp-pro] (value length = 1) or (2) a 0x7F code followed by a
4-octets of an extended attribute syntax type code as allocated in [ipp-
pro] (value length = 5).

ISSUE 01 - Ok to define the 'any-value' out-of-band value to have an
actual value, consisting of the attribute syntax code?



9  Conformance Requirements


This section specifies the conformance requirements for clients and IPP
objects.

Both the Set-Job-Attributes and the Set-Printer-Attributes operations
defined in the document are OPTIONAL for an IPP object to support.
Either one MAY be supported without the other or both MAY be supported.
However, if the Set-Printer-Attributes operation is supported, then the
Get-Printer-Supported-Values operation MUST be supported if any "xxx-


Kugler, Hastings, Herriot, Lewis                              [Page 24]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


supported" attributes are settable.  Otherwise, the Get-Printer-
Supported-Values operation is OPTIONAL for an IPP Printer to support.

If the Set-Printer-Attributes operation is supported, then the Printer
MUST support the following additional items:

     1.the Get-Printer-Supported-Values operation (see section 5), if
       any "xxx-supported" attributes are settable.

     2.the "printer-settable-attributes-supported" Printer Description
       attribute (see section 6.1)

     3.the 'not-settable' out-of-band value in responses (see section
       8.1)

     4.the 'client-error-not-settable' status code (see section 7.1)

     5.If "printer-message-from-operator" Printer Description attribute
       is supported (see [ipp-mod] section 4.4.25), then it MUST be
       settable.

     6.the Get-Printer-Supported-Values operation (see section 4.3), if
       any "xxx-supported" attributes are settable.

     7.If a client can set a value with the 'name' attribute syntax for
       one or more "xxx-supported" attributes, then the 'any-value'
       out-of-band attribute value (see section 8.3) MUST be supported
       in the Get-Printer-Supported-Values response with the 'name'
       attribute syntax for each such settable attribute (see section
       4.3)

If the Set-Job-Attributes operation is supported, then the Printer MUST
support the following additional items:

     1.the "job-settable-attributes-supported " Printer Description
       attribute (see section 6.2)

     2.the 'not-settable' out-of-band value in responses (see section
       8.1)

     3.the 'delete-attribute' out-of-band value in requests (see
       section 8.2)

     4.the 'client-error-not-settable' status code (see section 7.1)

     5.If the "job-message-from-operator" Printer Description attribute
       is supported (see [ipp-mod] 4.3.16), then it MUST be settable.

It is OPTIONAL for the Printer object to support the "printer-message-
time" (integer) and "printer-message-date-time" (dateTime) Printer
Description attributes.  If both the "printer-message-time" (integer)
and the "printer-current-time" (dateTime) (see [ipp-mod] section 4.4.30)
attributes are supported, then the "printer-message-date-time"
(dateTime) Printer Description attribute MUST be supported.

Kugler, Hastings, Herriot, Lewis                              [Page 25]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


As with all out-of-band values, a client or a Printer MUST NOT use an
out-of-band value unless the definition of the attribute in an operation
request and/or response explicitly allows such usage.



10 IANA Considerations

Since this document is intended to be a standards track document, there
is no need to also register the operations, attributes, status codes,
and out-of-band values defined here-in with IANA according to the
procedures in RFC 2566 [rfc2566] section 6.  However, other registration
proposals may site the out-of-band attribute values or the status codes
defined in this document.


11 Internationalization Considerations

This document has the same localization considerations as the [ipp-mod].


12 Security Considerations


The IPP Model and Semantics document [ipp-mod section 8] discusses high
level security requirements (Client Authentication, Server
Authentication and Operation Privacy). Client Authentication is the
mechanism by which the client proves its identity to the server in a
secure manner. Server Authentication is the mechanism by which the
server proves its identity to the client in a secure manner. Operation
Privacy is defined as a mechanism for protecting operations from
eavesdropping.

In addition, the introduction of the Set-Printer-Attributes and Set-Job-
Attributes operations creates another security threat, since the client
is able to modify the Printer and Job attributes stored in the Printer.
Such modifications could lead to denial of service.

A malicious user could alter the policy established by the system
administrator and stored in the Printer attributes.  Such alteration
could either grant access to more resources or deny access to resources
that the system administrator has established.  For example, the
malicious user could remove all of the document-format values from the
"document-format-supported" Printer attribute so that the Printer would
refuse to accept all jobs.

The general remedy for such malicious user actions against Printer
attributes is to have strong Client Authentication coupled with Printer
access control to limit the users who have System Administrator or
Operator privileges.

A malicious user could modify the Job Template attributes of another
user's Job, such as the "copies" attribute.  For example, setting the
number of copies to a large number.


Kugler, Hastings, Herriot, Lewis                              [Page 26]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


13 The general remedy for such malicious user actions against another
   user's job is to have strong Client Authentication coupled with
   Printer access control to limit the users who have System
   Administrator or Operator privileges who can modify any job and, in
   addition, store the Client Authentication with each Job so that only
   the job owner End User can modify his/her own job.Author's Addresses

   Carl Kugler
   IBM
   P.O. Box 1900
   Boulder, CO 80301-9191

   Phone: (303) 924-5060
   FAX:
   e-mail:  kugler@us.ibm.com

   Tom Hastings
   Xerox Corporation
   737 Hawaii St.  ESAE 231
   El Segundo, CA  90245

   Phone: 310-333-6413
   Fax: 310-333-5514
   e-mail: hastings@cp10.es.xerox.com

   Robert Herriot
   Xerox Corp.
   3400 Hill View Ave, Building 1
   Palo Alto, CA 94304

   Phone: 650-813-7696
   Fax:   650-813-6860
   e-mail: robert.herriot@pahv.xerox.com

   Harry Lewis
   IBM
   P.O. Box 1900
   Boulder, CO 80301-9191

   Phone: (303) 924-5337
   FAX:
   e-mail:  harryl@us.ibm.com



14 References

[ipp-mod]
     R. deBry, T. Hastings, R. Herriot, S. Isaacson, P. Powell,
     "Internet Printing Protocol/1.0: Model and Semantics", <draft-ietf-
     ipp-model-v11-06.txt>, March 1, 2000.




Kugler, Hastings, Herriot, Lewis                              [Page 27]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


[ipp-pro]
     Herriot, R., Butler, S., Moore, P., Tuner, R., "Internet Printing
     Protocol/1.1: Encoding and Transport", draft-ietf-ipp-protocol-v11-
     05.txt, March 1, 2000.

[ipp-set2]
     Kugler, C, Hastings, T., Lewis, H., "Internet Printing
     Protocol/1.1: Job and Printer Administrative Operations", <draft-
     ietf-ipp-ops-set2-01.txt>, December 8, 1999.

[RFC2565]
     Herriot, R., Butler, S., Moore, P., Tuner, R., "Internet Printing
     Protocol/1.0: Encoding and Transport", RFC 2565, April 1999.

[RFC2566]
     R. deBry, T. Hastings, R. Herriot, S. Isaacson, P. Powell,
     "Internet Printing Protocol/1.0: Model and Semantics", RFC 2566,
     April 1999.



15 Change History


This section summarizes the changes.  Each sub-section is in reverse
chronological order.  Adding or removing ISSUES that don't change the
document are not listed here.


15.1Changes to the January 30, 2000 version to make the March 1, 2000
    version


The following changes to the January 30, 2000 version to make the March
1, 2000 version as a result of the IPP WG telecons and mailing list
discussion:

1.Clarified that this extension may be used with any IPP version,
  including 1.0, 1.1, and future versions.

2.Added "READ-ONLY" and "not-settable" terms to the terminology
  section.  READ-ONLY is by definition, and "not-settable" is by
  implementation.

3.Assigned the "operation-id" values 0x0013, 0x0014, and 0x0015,
  respectively, for the Set-Printer-Attributes, Set-Job-Attributes, and
  Get-Printer-Supported-Values operations.

4.Clarified that the Set-Printer-Attributes operation while a Printer
  SHOULD accept a reasonable number of attribute, the Printer need only
  support setting one attribute in a request, unless it supports
  setting the three "parallel" attributes, ("printer-uri-supported",
  "uri-authentication-supported", and "uri-security-supported" (see
  [ipp-mod] sections 4.4.1 through 4.4.3), in which case it MUST
  support setting at least three attributes in a single request.


Kugler, Hastings, Herriot, Lewis                              [Page 28]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


5.Clarified that for the Set-Printer-Attributes operation the Printer
  MUST validate all of the supplied attributes in combination with each
  other, as well as with all of the existing attribute of the Printer
  object Set-Printer-Attributes.

6.Changed the requirements for accepting the Set-Printer-Attributes
  operation when the Printer is in the 'stopped' state from MUST to
  SHOULD, since some implementations may not be able to accept requests
  when stopped.

7.Clarified that setting certain Printer attributes with Set-Printer-
  Attributes MAY require more access rights than other attributes,
  i.e., System Administrator rights to set policy and only Operator
  rights to set the configuration attributes to reflect the current
  hardware setup.

8.Clarified the order of error checking and what is returned in each
  case in the Set-Printer-Attributes response.

9.Changed the 'default' out-of-band value to 'delete-attribute' out-of-
  band value so that the effect is to actually remove the Job attribute
  entirely in the Set-Job-Attribute operation.

10.  Clarified that removing a Job attribute that is not present is not
  an error.

11.  Clarified the validation of the Set-Job-Attributes request and what
  is returned for each error.

12.  Changed the 'any-name' out-of-band attribute value to a more
  general 'any-value' out-of-band attribute value which in combination
  with an attribute syntax represents any value of that attribute
  syntax.  The 'any-value' value can be used with the 'name' attribute
  syntax in a Get-Printer-Supported-Values response to indicate whether
  or not a Set-Printer-Attributes will accept any name to be set for
  particular "xxx-supported" (1setOf name | ...) Printer attributes.

13.  Clarified that "printer-message-from-operator" and "job-message-
  from-operator" both REQUIRE that the Printer accept zero-length
  messages and the 'no-value' out-of-band value is synonymous with
  removing any value from these Printer attributes.

14.  Clarified that the Get-Printer-Supported-Values is REQUIRED only if
  the Set-Printer-Attributes operation will accept setting some  "xxx-
  supported" Printer attributes.

15.  Changed the IANA Considerations to indicate that the operations,
  attributes, status codes, and out-of-band-values won't be registered
  and published by IANA, since this document is intended to be
  standards track.

16.  Added security considerations for denial of service and sabotage
  because of the Set operations.


Kugler, Hastings, Herriot, Lewis                              [Page 29]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


15.2Changes to the January 20, 2000 version to make the January 30, 2000
    version


The following changes to the January 20, 2000 version to make the
January 30, 2000 version as a result of the IPP WG telecons and mailing
list discussion:

1.Deleted the "document-format-varying-scope" operation attribute from
  the Set-Printer-Attributes operation and made whether or not the
  "document-format" operation was present determine whether one or all
  document formats are affected, respectively.

2.Renamed the Get-Reset-Printer-Attributes operation to Get-Printer-
  Supported-Values, so that it only returns "xxx-supported" values.
  Relegate obtaining reset values to another operation to be paired
  with the Reset-Printer operation in the Set2 [ipp-set2] document.

3.Added "-supported" to the names of the "printer-settable-attributes"
  and "job-settable-attributes" Printer Description attributes, so that
  they could be returned in Get-Printer-Supported-Values and could be
  set by Set-Printer-Attributes.

4.Deleted "authentication-methods-supported" (1setOf type2 keyword) and
  "security-methods-supported" (1setOf type2 keyword) and clarified
  that "uri-authentication-supported" (1setOf type2 keyword) and "uri-
  security-supported" (1setOf type2 keyword) can return multiple
  keywords of the same value in a Get-Printer-Supported-Values
  operation.


15.3Changes to the January 4, 2000 version to make the January 20, 2000
    version


The following changes to the January 4, 2000 version to make the January
4, 2000 version as a result of the IPP WG telecons and mailing list
discussion:

1.Replaced the "factory-settings" operation attribute proposed to be
  added to the Get-Printer-Attributes operation with the Get-Rest-
  Printer-Attributes operation which returns the reset values and the
  possible "xxx-supported" values.

2.Added the out-of-band 'any-name' value to be used with "xxx-
  supported" attributes with attribute syntax 'type3 keyword | name' to
  indicate that any name will be accepted in a Job Creation operation
  for configurations that support such a concept.

3.Added authentication-methods-supported (1setOf type2 keyword) and
  security-methods-supported (1setOf type2 keyword) Printer Description
  attributes so that clients can discover the possible values for use
  in Set-Printer-Attributes to set "uri-authentication-supported" and
  "uri-security-supported" attributes, since the Reset-Printer
  operation doesn't change them.


Kugler, Hastings, Herriot, Lewis                              [Page 30]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


4.Added validation rules that the Printer MUST use to validate a Set-
  Printer-Attributes request.

5.Clarified that the Set-Printer-Attributes operation MUST NOT have any
  side effects on other attributes, unless explicitly specified in this
  document.

6.Moved the specification of the attributes that MUST be READ-ONLY to
  Appendix A.

7.Added the "document-format-varying-attributes" (1setOf type2 keyword)

8.Added the REQUIRED "document-format-varying-scope" operation
  attribute to Set-Printer-Attributes in order to control whether one
  or all document formats are affected for those attributes that vary
  by document format.

9.Clarified that the Printer returns the 'client-error-attributes-not-
  settable' status code in a Set-Printer-Attributes response whether
  the attribute is READ-ONLY, the attribute is not supported, or the
  value is not supported.

10.  Added the out-of-band 'default' value for use with Set-Job-
  Attributes and Job Creation operations.

11.  Deleted the "printer-message-operation" Printer Description
  attribute.

12.  Made the "Get-Reset-Printer-Attributes" operation, along with the
  "authentication-methods-supported" and the "security-methods-
  supported" Printer Description attributes REQUIRED, if the Set-
  Printer-Attributes operation is supported.

13.  Made the  'not-settable' out-of-band value and the 'client-error-
  not-settable' status code REQUIRED, if the Set-Printer-Attributes
  operation is supported.

14.  Made the 'default' out-of-band value REQUIRED, if the Set-Job-
  Attributes operation is supported.

15.  Removed the requirement that "xxx-supported" Printer Description
  attributes that contain only one value be read-only.


15.4Changes to the December 8, 1999 version to make the January 4, 2000
    version


The following changes to the December 8, 1999 version to make the
January 4, 2000 version as a result of the IPP WG telecons and mailing
list discussion:

1.Removed the Set operations and related items from the Set2
  specification [ipp-set2] to create this Set specification.


Kugler, Hastings, Herriot, Lewis                              [Page 31]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


2.Added that an attribute that can only be set to one fixed value
  SHOULD NOT be included in the "printer-settable-attributes" or "job-
  settable-attributes" attributes.

3.Indicated that the encoding of the 'not-settable' out-of-band value
  is TBD.

4.Added that Set-Job-Attributes operation adds an attribute to the Job
  object if it wasn't already there

5.Added the conformance section to make it easy to understand the
  conformance requirements.



16 Appendix A: Allowed Values for Set-Printer-Attributes


This appendix is a normative part of this document and contains a table
of all IPP/1.1 attributes.  Each row contains

     An attribute and

     The values allowed in the Set-Printer-Attributes operation for the
     attribute.  The entry in each cell is the name (first few words) of
     each item below 1, 2, 3, 4a-g, and 5.

The allowed values include the following cases:

  1. READ-ONLY:  the Set-Printer-Attributes operation MUST NOT change
     this attribute

  2. Any of  "xxx-supported":  the  Set-Printer-Attributes operation
     accepts values that are allowed according to the IPP/1.1 rules for
     the "xxx-supported" attribute (see section 3.1.2.3 of the "Internet
     Printing Protocol/1.1: Implementer's Guide" [ipp-iig]). The 'xxx-
     supported' attribute value is obtained from a 'Get-Printer-
     Attributes' response.

  3. From Get-Printer-Supported-Values:  the  Set-Printer-Attributes
     operation accepts values that are allowed according to the IPP/1.1
     rules for the "xxx-supported" attribute (see section 3.1.2.3 of the
     "Internet Printing Protocol/1.1: Implementer's Guide" [ipp-iig]).
     The "xxx-supported" attribute value is obtained from a Get-Printer-
     Supported-Values response (see Appendix B: Attributes returned from
     Get-Printer-Supported-Values below).

  4. Any value of the proper attribute syntax:  the Set-Printer-
     Attributes accepts any value of the specified attribute syntax.
     The attribute syntaxes supported are enumerated below.

     a.Any text(127)
     b.Any name(127)
     c.Any uri
     d.Any boolean
     e.Any positive integer
     f.Any dateTime
     g.1setOf any uri


Kugler, Hastings, Herriot, Lewis                              [Page 32]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


  5. Combination of 'Any of "xxx-supported"' or 'Any name'.

If a Printer implementation doesn't want to allow setting values
indicated in this Appendix as "any xxx", it can make the value be read-
only.  For example, for a monochrome printer the attribute "color-
supported" is "false" and MUST be read-only.  Otherwise an administrator
could set it to "true" because the value can have "any boolean"
according to the rules in Table 6 below.

  Table 3 - Values allowed for Job Template Attributes in the Set-Job-
                          Attributes Operation

Job Template Attributes                      Values allowed for Set

job-priority (integer(1:100))                Any of  "xxx-supported"
job-hold-until (type3 keyword | name (MAX))  Any of  "xxx-supported"
job-sheets (type3 keyword | name(MAX))       Any of  "xxx-supported"
multiple-document-handling (type2 keyword)   Any of  "xxx-supported"
copies (integer(1:MAX))                      Any of  "xxx-supported"
finishings (1setOf type2 enum)               Any of  "xxx-supported"
page-ranges (1setOf rangeOfInteger (1:MAX))  Any of  "xxx-supported"
sides (type2 keyword)                        Any of  "xxx-supported"
number-up (integer(1:MAX))                   Any of  "xxx-supported"
orientation-requested (type2 enum)           Any of  "xxx-supported"
media (type3 keyword | name(MAX))            Any of  "xxx-supported"
printer-resolution (resolution)              Any of  "xxx-supported"
print-quality (type2 enum)                   Any of  "xxx-supported"


Table 4 - Values allowed for Job Description Attributes in the Set-Job-
                          Attributes Operation

Job Description Attributes                   Values allowed for Set

job-uri (uri)                                READ-ONLY
job-id (integer(1:MAX))                      READ-ONLY
job-printer-uri (uri)                        READ-ONLY
job-more-info (uri)                          READ-ONLY
job-name (name(MAX))                         Any name(MAX)
job-originating-user-name (name(MAX))        READ-ONLY
job-state (type1 enum)                       READ-ONLY
job-state-reasons (1setOf  type2 keyword)    READ-ONLY
job-state-message (text(MAX))                READ-ONLY
job-detailed-status-messages (1setOf         READ-ONLY
text(MAX))
job-document-access-errors (1setOf           READ-ONLY
text(MAX))
number-of-documents (integer(0:MAX))         READ-ONLY
output-device-assigned (name(127))           READ-ONLY
time-at-creation (integer(MIN:MAX))          READ-ONLY
time-at-processing (integer(MIN:MAX))        READ-ONLY
time-at-completed (integer(MIN:MAX))         READ-ONLY
job-printer-up-time (integer(1:MAX))         READ-ONLY
date-time-at-creation (dateTime)             READ-ONLY
date-time-at-processing (dateTime)           READ-ONLY
date-time-at-completed (dateTime)            READ-ONLY

Kugler, Hastings, Herriot, Lewis                              [Page 33]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


Job Description Attributes                   Values allowed for Set

number-of-intervening-jobs (integer(0:MAX))  READ-ONLY
job-message-from-operator (text(127))        Any text(127)
job-k-octets (integer(0:MAX))                READ-ONLY
job-impressions (integer(0:MAX))             READ-ONLY
job-media-sheets (integer(0:MAX))            READ-ONLY
job-k-octets-processed (integer(0:MAX))      READ-ONLY
job-impressions-completed (integer(0:MAX))   READ-ONLY
job-media-sheets-completed (integer(0:MAX))  READ-ONLY
attributes-charset (charset)                 READ-ONLY
attributes-natural-language                  READ-ONLY
(naturalLanguage)


Table 5 - Values allowed for Printer Job Template Attributes in the Set-
                      Printer-Attributes Operation

Printer Job Template Attributes              Values allowed for Set

job-priority-default (integer(1:100))        Any of  "xxx-supported"
job-hold-until-default (type3 keyword |      Any of  "xxx-supported"
name (MAX))
job-sheets-default (type3 keyword |          Any of  "xxx-supported"
name(MAX))
multiple-document-handling-default (type2    Any of  "xxx-supported"
keyword)
copies-default (integer(1:MAX))              Any of  "xxx-supported"
finishings-default (1setOf type2 enum)       Any of  "xxx-supported"
sides-default (type2 keyword)                Any of  "xxx-supported"
number-up-default (integer(1:MAX))           Any of  "xxx-supported"
orientation-requested-default (type2 enum)   Any of  "xxx-supported"
media-default (type3 keyword | name(MAX))    Any of  "xxx-supported"
printer-resolution-default (resolution)      Any of  "xxx-supported"
print-quality-default (type2 enum)           Any of  "xxx-supported"
job-priority-supported (integer(1:100))      From Get-Printer-
                                             Supported-Values
job-hold-until-supported (1setOf(type3       From Get-Printer-
keyword | name (MAX)))                       Supported-Values
job-sheets-supported (1setOf(type3 keyword   From Get-Printer-
| name(MAX)))                                Supported-Values
multiple-document-handling-supported         From Get-Printer-
(1setOf type2 keyword)                       Supported-Values
copies-supported (rangeOfInteger(1:MAX))     From Get-Printer-
                                             Supported-Values
finishings-supported (1setOf type2 enum)     From Get-Printer-
                                             Supported-Values
page-ranges-supported (boolean)              From Get-Printer-
                                             Supported-Values
sides-supported (1setOf type2 keyword)       From Get-Printer-
                                             Supported-Values
number-up-supported (1setOf (integer(1:MAX)  From Get-Printer-
| rangeOfInteger(1:MAX)))                    Supported-Values
orientation-requested-supported (1setOf      From Get-Printer-
type2 enum)                                  Supported-Values

Kugler, Hastings, Herriot, Lewis                              [Page 34]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


Printer Job Template Attributes              Values allowed for Set

media-supported (1setOf (type3 keyword |     From Get-Printer-
name(MAX)))                                  Supported-Values
printer-resolution-supported (1setOf         From Get-Printer-
resolution)                                  Supported-Values
print-quality-supported (1setOf type2 enum)  From Get-Printer-
                                             Supported-Values
media-ready (type3 keyword | name(MAX))      From Get-Printer-
                                             Supported-Values


Table 6 - Values allowed for Printer Description Attributes in the Set-
                      Printer-Attributes Operation

Printer Description Attributes               Values allowed for Set

printer-uri-supported (1setOf uri)           From Get-Printer-
                                             Supported-Values
uri-authentication-supported (1setOf type2   From Get-Printer-
keyword)                                     Supported-Values
uri-security-supported (1setOf type2         From Get-Printer-
keyword)                                     Supported-Values
printer-name (name(127))                     Any name(127)
printer-location (text(127))                 Any text(127)
printer-info (text(127))                     Any text(127)
printer-more-info (uri)                      Any uri
printer-driver-installer (uri)               Any uri
printer-make-and-model (text(127))           Any text(127)
printer-more-info-manufacturer (uri)         Any uri
printer-state (type1 enum)                   READ-ONLY
printer-state-reasons (1setOf type2          READ-ONLY
keyword)
printer-state-message (text(MAX))            READ-ONLY
ipp-versions-supported (1setOf type2         From Get-Printer-
keyword)                                     Supported-Values
operations-supported (1setOf type2 enum)     From Get-Printer-
                                             Supported-Values
multiple-document-jobs-supported (boolean)   From Get-Printer-
                                             Supported-Values
charset-configured (charset)                 Any of  "xxx-supported"
charset-supported (1setOf charset)           From Get-Printer-
                                             Supported-Values
natural-language-configured                  Any of  "xxx-supported",
(naturalLanguage)                            use generated-natural-
                                             language-supported
generated-natural-language-supported         From Get-Printer-
(1setOf naturalLanguage)                     Supported-Values
document-format-default (mimeMediaType)      Any of  "xxx-supported"
document-format-supported (1setOf            From Get-Printer-
mimeMediaType)                               Supported-Values
printer-is-accepting-jobs (boolean)          READ-ONLY
queued-job-count (integer(0:MAX))            READ-ONLY
printer-message-from-operator (text(127))    Any text(127)
color-supported (boolean)                    From Get-Printer-

Kugler, Hastings, Herriot, Lewis                              [Page 35]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


Printer Description Attributes               Values allowed for Set

                                             Supported-Values
reference-uri-schemes-supported (1setOf      From Get-Printer-
uriScheme)                                   Supported-Values
pdl-override-supported (type2 keyword)       From Get-Printer-
                                             Supported-Values
printer-up-time (integer(1:MAX))             READ-ONLY
printer-current-time (dateTime)              Any dateTime
multiple-operation-time-out                  any positive integer
(integer(1:MAX))
compression-supported (1setOf type3          From Get-Printer-
keyword)                                     Supported-Values
job-k-octets-supported                       From Get-Printer-
(rangeOfInteger(0:MAX))                      Supported-Values
job-impressions-supported                    From Get-Printer-
(rangeOfInteger(0:MAX))                      Supported-Values
job-media-sheets-supported                   From Get-Printer-
(rangeOfInteger(0:MAX))                      Supported-Values
pages-per-minute (integer(0:MAX))            READ-ONLY
pages-per-minute-color (integer(0:MAX))      READ-ONLY
printer-settable-attributes-supported        From Get-Printer-
(1setOf type2 keyword)                       Supported-Values
job-settable-attributes-supported (1setOf    From Get-Printer-
type2 keyword)                               Supported-Values
document-format-varying-attributes (1setOf   READ-ONLY
type2 keyword)
printer-message-time (integer(MIN:MAX))      READ-ONLY
printer-message-date-time(dateTime)          READ-ONLY



17 Appendix B: Attributes returned from Get-Printer-Supported-Values


For the following attributes, the value allowed by the Set-Printer-
Attributes operation MUST be a single integer value in the range
specified by the value returned by the Get-Printer-Supported-Values
operation.

  Table 7 - Printer Job Template Attributes returned from Get-Printer-
                            Supported-Values

Printer Job Template Attributes               Values Returned

job-priority-supported (integer(1:100))       rangeOfInteger(1:100)


For the following attributes, the value allowed by the Set-Printer-
Attributes operation MUST be a single rangeOfInteger value whose bounds
do not exceed those of  the range specified by the value returned by the
Get-Printer-Supported-Values operation.





Kugler, Hastings, Herriot, Lewis                              [Page 36]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


  Table 8 - Printer Job Template Attributes returned from Get-Printer-
                            Supported-Values

Printer Job Template Attributes              Values Returned

copies-supported (rangeOfInteger(1:MAX))     rangeOfInteger(1:MAX)



The following table has the same criteria as the last, but is for
Printer Description attributes.

  Table 9 - Printer Description Attributes returned from Get-Printer-
                            Supported-Values

Printer Description Attributes               Values allowed for Set

job-k-octets-supported                       rangeOfInteger(0:MAX)
(rangeOfInteger(0:MAX))
job-impressions-supported                    rangeOfInteger(0:MAX)
(rangeOfInteger(0:MAX))
job-media-sheets-supported                   rangeOfInteger(0:MAX)
(rangeOfInteger(0:MAX))


For the following attributes, the value allowed by the Set-Printer-
Attributes operation MUST be one or more integers and rangeOfInteger
values, such that the integer values described by these integers and
rangeOfInteger is the same as or a subset of the integers described by
the integers and rangeOf Integer of value returned by the Get-Printer-
Supported-Values operation.

 Table 10 - Printer Job Template Attributes returned from Get-Printer-
                            Supported-Values

Printer Job Template Attributes              Values Returned

number-up-supported (1setOf (integer(1:MAX)  1setOf (integer(1:MAX) |
| rangeOfInteger(1:MAX)))                    rangeOfInteger(1:MAX))


For the following attributes, the value allowed by the Set-Printer-
Attributes operation MUST be one or more values, where each such value
matches a value returned by the Get-Printer-Supported-Values operation.
A keyword, enum, boolean, charset, naturalLanguage, uriScheme,
mimeMediaType or resolution value matches if it is equal. A name matches
the 'any-name' out-of-band value.

 Table 11 - Printer Job Template Attributes returned from Get-Printer-
                            Supported-Values

Printer Job Template Attributes              Values Returned

job-hold-until-supported (1setOf(type3       1setOf(type3 keyword |
keyword | name (MAX)))                       any name)
job-sheets-supported (1setOf(type3 keyword   1setOf(type3 keyword |
| name(MAX)))                                any name)


Kugler, Hastings, Herriot, Lewis                              [Page 37]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


Printer Job Template Attributes              Values Returned

multiple-document-handling-supported         1setOf type2 keyword
(1setOf type2 keyword)
finishings-supported (1setOf type2 enum)     1setOf type2 enum
page-ranges-supported (boolean)              1setOf(boolean)
sides-supported (1setOf type2 keyword)       1setOf type2 keyword
orientation-requested-supported (1setOf      1setOf type2 enum
type2 enum)
media-supported (1setOf (type3 keyword |     1setOf(type3 keyword |
name(MAX)))                                  any name)
printer-resolution-supported (1setOf         1setOf resolution
resolution)
print-quality-supported (1setOf type2 enum)  1setOf type2 enum



The following table has the same criteria as the last, but is for
Printer Description attributes.  Note that the first two attributes in
the table below follow the rules for allowed values in the Set-Printer-
Attributes, but unlike other attributes, there can be more than one
occurrence of each value because the i-th value of these attributes
specifies the authentication or security for the i-th printer in
"printer-uri-supported".

  Table 12 - Printer Description Attributes returned from Get-Printer-
                            Supported-Values

Printer Description Attributes               Values allowed for Set

uri-authentication-supported (1setOf type2   1setOf type2 keyword
keyword)
uri-security-supported (1setOf type2         1setOf type2 keyword
keyword)
ipp-versions-supported (1setOf type2         1setOf type2 keyword
keyword)
operations-supported (1setOf type2 enum)     1setOf type2 keyword
multiple-document-jobs-supported (boolean)   1setOf boolean
charset-supported (1setOf charset)           1setOf charset
generated-natural-language-supported         1setOf naturalLanguage
(1setOf naturalLanguage)
document-format-supported (1setOf            1setOf mimeMediaType
mimeMediaType)
color-supported (boolean)                    1setOf boolean
reference-uri-schemes-supported (1setOf      1setOf uriScheme
uriScheme)
compression-supported (1setOf type3          1setOf type3 keyword
keyword)
printer-settable-attributes-supported        1setOf type2 keyword
(1setOf type2 keyword)
job-settable-attributes-supported (1setOf    1setOf type2 keyword
type2 keyword)




Kugler, Hastings, Herriot, Lewis                              [Page 38]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000




For the following attributes, the value allowed by the Set-Printer-
Attributes operation MUST be a single value that matches one of the
values returned by the Get-Printer-Supported-Values operation. A
keyword, enum, boolean, charset, naturalLanguage, uriScheme,
mimeMediaType or resolution value matches if it is equal. A name matches
the 'any-name' out-of-band value.


  Table 13 - Printer Description Attributes returned from Get-Printer-
                            Supported-Values

Printer Description Attributes               Values allowed for Set

pdl-override-supported (type2 keyword)       1 setOf type2 keyword


For the following attributes, the Set-Printer-Attributes operation MUST
NOT return a value. The IPP Model document [ipp-mod] document specifies
the allowed values.


  Table 14 - Printer Description Attributes returned from Get-Printer-
                            Supported-Values

Printer Description Attributes               Values allowed for Set

printer-uri-supported (1setOf uri)           any uri



18 Appendix C: Full Copyright Statement


Copyright (C) The Internet Society (1998,1999). All Rights Reserved

This document and translations of it may be copied and furnished to
others, and derivative works that comment on or otherwise explain it or
assist in its implementation may be prepared, copied, published and
distributed, in whole or in part, without restriction of any kind,
provided that the above copyright notice and this paragraph are included
on all such copies and derivative works.  However, this document itself
may not be modified in any way, such as by removing the copyright notice
or references to the Internet Society or other Internet organizations,
except as needed for the purpose of developing Internet standards in
which case the procedures for copyrights defined in the Internet
Standards process must be followed, or as required to translate it into
languages other than English.

The limited permissions granted above are perpetual and will not be
revoked by the Internet Society or its successors or assigns.

This document and the information contained herein is provided on an "AS
IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK
FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT

Kugler, Hastings, Herriot, Lewis                              [Page 39]
                     Expires:  September 1, 2000




INTERNET-DRAFT   IPP: Job and Printer Set Operations      March 1, 2000


LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT
INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR
FITNESS FOR A PARTICULAR PURPOSE.




















































Kugler, Hastings, Herriot, Lewis                              [Page 40]
                     Expires:  September 1, 2000
